perf/bbox_prueba-2-workers.yml
config:
  environments:
    servicio2:
      target: 'http://localhost:9091/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-endpoint2"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 100
      arrivalRate: 6.6

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'