perf/caso3.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
      gunicorn:
        target: 'http://localhost:5555/gunicorn'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-gunicorn"

    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

    phases:
      - name: Plain
        duration: 80
        arrivalRate: 0.4
      - name: Finish
        duration: 60
        arrivalRate: 0

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/heavy'